In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando","baltimore"],
    "temperature":[21,14,35,40]
})

In [3]:
df2 = pd.DataFrame({
    "city": ["new york","chicago","san francisco"],
    "humidity":[65,68,75]
})

In [4]:
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           40

In [5]:
df2

            city  humidity
0       new york        65
1        chicago        68
2  san francisco        75

In [6]:
df3=pd.merge([df1,df2],on ="city")
df3

TypeError: merge() missing 1 required positional argument: 'right'

In [7]:
# merge is bascially inner join like the only thing present in both

In [18]:
df3=pd.merge(df1,df2,on ="city",how="outer",indicator=True)
df3

            city  temperature  humidity      _merge
0      baltimore         40.0       NaN   left_only
1        chicago         14.0      68.0        both
2       new york         21.0      65.0        both
3        orlando         35.0       NaN   left_only
4  san francisco          NaN      75.0  right_only

In [17]:
df3=pd.merge(df1,df2,on ="city",how="right")
df3

            city  temperature  humidity
0       new york         21.0        65
1        chicago         14.0        68
2  san francisco          NaN        75

In [16]:
df3=pd.merge(df1,df2,on ="city",how="left")
df3

        city  temperature  humidity
0   new york           21      65.0
1    chicago           14      68.0
2    orlando           35       NaN
3  baltimore           40       NaN

In [22]:
df2 = pd.DataFrame({
    "city": ["new york","chicago","san francisco"],
    "humidity":[96,67,70]
})
df2

            city  humidity
0       new york        96
1        chicago        67
2  san francisco        70

In [21]:
df3 = pd.DataFrame({
    "city": ["new york","chicago","san francisco"],
    "humidity":[65,68,75]
})
df3

            city  humidity
0       new york        65
1        chicago        68
2  san francisco        75

In [25]:
pd.merge(df2,df3,on="city",indicator=True,suffixes =["_left","_right"])

            city  humidity_left  humidity_right _merge
0       new york             96              65   both
1        chicago             67              68   both
2  san francisco             70              75   both